docs: updated readme to trigger build pipline
