--- a/README.md
+++ b/README.md
@@ -23,17 +23,19 @@ scale every service independently of the management service.
 
 ## Overview
 
-```mermaid
-flowchart TD
-    issint[\Verifier Business System\]
-    isam(Verifier Management Service)
-    isdb[(Postgres)]
-    isoi(Verifier Validator Service)
-    wallet[Wallet]
-    issint ---> isam
-    isam ---> isdb
-    isoi ---> isdb
-    wallet ---> isoi
+```plantuml
+@startuml
+    [Verifier Business System] as issint
+    (Verifier Management Service) as isam
+    [(Postgres)] as isdb
+    (Verifier Validator Service) as isoi
+    [Wallet] as wallet
+
+    issint --> isam
+    isam --> isdb
+    isoi --> isdb
+    wallet --> isoi
+@enduml
 ```
 
 For a general overview over all components, please check [Overview](https://TODO-add-correct-link)
